## 2.3.4

Добавлена возможность полноценно использовать регэкспы в ключе поиска `--query-path`.

Проблема была в том, что для shell ряд символом являются управляющими, соответственно, в "сыром" виде эти смволы использовать в аргументах командной строки нельзя.
Для избегания конфликтов с управляющими символами оболочки, в регэкспах нужно заменять служебные символы:

| Управляющий символ | Замена |
|--------------------|--------|
| !                  | ¡      |
| -                  | ⊸      |
| -                  | ⌁      |
| (                  | ⟮      |
| )                  | ⟯      |
| ;                  | ⁏      |
| $                  | ฿      |

То есть, чтобы склонить всё из группы `myapp`, но без подгруппы `myapp/legacy`: \
`$ gitlab-tools clone --dir . --qp ^myapp\/⟮?¡legacy⟯.*` 

Здесь восклицательный знак и скобки в регэкспе заменены безопасные подмены.

## 2.3.3

Исправлен вечный цикл и ряд глупых багов в clone.

В зависимости добавлен `jest`, поэтому перед сборкой нужно кастануть `$ npm install`

## 2.3.2

Добавлен спиннер для оживления и индикации длительных процессов